INSERT INTO course
VALUES #插入班级表信息
       (1, '网络21333', '信息工程系', 7),
       (2, '网络21334', '信息工程系', 6),
       (3, '智能控制21302', '机电工程系', 3),
       (4, '智能控制21303', '机电工程系', 3);



INSERT INTO class
VALUES #插入课程表信息
       (101, '计算机导论', '专业必修课', 2, 1, '邹老师'),
       (102, '程序设计基础', '专业必修课', 2, 1, '曾老师'),
       (206, '毛泽东思想和中国特色社会主义理论体系概论', '公共课', 4, 2, '叶老师'),
       (208, '数据结构', '选修课', 4, 4, '冯老师'),
       (209, '操作系统', '专业必修课', 4, 3, '曾老师'),
       (210, '计算机原理', '选修课', 5, 4, '周老师'),
       (301, '计算机网络', '专业必修课', 3, 2, '王老师');



ALTER TABLE student
    CHANGE sex sex ENUM ('男','女') DEFAULT '男'; #添加一个枚举


INSERT INTO student
VALUES #插入学生表信息
       (081103, '王燕', '女', '四川成都', '1989-10-06', NULL, 1),
       (081104, '韦严平', '男', '重庆', '1990-8-26', NULL, 1),
       (081106, '李方方', '男', '四川南充', '1990-11-20', NULL, 2),
       (081107, '李明', '男', '四川乐山', '1990-05-01', '提前修完<数据结构>,并获得学分', 2),
       (081108, '林一帆', '男', '四川绵阳', '1989-08-05', '已提前修完一门课', 1),
       (081109, '张强民', '男', '四川德阳', '1989-08-11', NULL, 1),
       (081110, '张蔚', '女', '重庆', '1991-07-22', '三好学生', 1),
       (081111, '赵琳', '女', '四川成都', '1990-03-18', NULL, 1),
       (081113, '严红', '女', '四川广汉', '1989-8-11', '有一门课程不及格,待补考', 2),
       (081201, '王敏', '女', '四川广元', '1989-06-10', NULL, 1),
       (081202, '王林', '男', '四川广元', '1989-01-29', '有一门课不及格,待补考', 2),
       (081206, '马琳琳', '女', '四川乐山', '1989-02-10', NULL, 2)
       (081206, '李计', '男', '四川成都', '1989-09-20', NULL, 1),
       (081210, '李红庆', '男', '四川绵阳', '1989-05-01', '已提前修完一课，并获得学分', 3),
       (081216, '张祥欣', '男', '陕西西安', '1989-03-09', NULL, 4),
       (081218, '孙研', '男', '四川成都', '1990-10-09', NULL, 3),
       (081220, '吴薇华', '女', '四川内江', '1990-03-18', NULL, 3),
       (081221, '刘燕敏', '女', '四川绵阳', '1989-11-12', NULL, 3),
       (081241, '罗林琳', '女', '四川自贡', '1990-01-30', '转专业学习', 4);



INSERT INTO learn
VALUES #插入成绩表信息
       (081103, 101, 62),
       (081103, 102, 70),
       (081103, 206, 81),
       (081104, 101, 90),
       (081104, 102, 54),
       (081104, 206, 65),
       (081106, 101, 65),
       (081106, 102, 80),
       (081106, 206, 80),
       (081107, 101, 58),
       (081107, 102, 80),
       (081107, 206, 68),
       (081108, 101, 85),
       (081108, 102, 64),
       (081108, 206, 87),
       (081109, 101, 66),
       (081109, 102, 83),
       (081109, 206, 70),
       (081110, 101, 55),
       (081110, 102, 90),
       (081110, 206, 89),
       (081111, 101, 91),
       (081111, 102, 70),
       (081111, 206, 76),
       (081113, 101, 63),
       (081113, 102, 79),
       (081113, 206, 60),
       (081201, 101, 80),
       (081202, 101, 65),
       (081204, 101, 91),
       (081210, 101, 76),
       (081216, 101, 81),
       (081218, 101, 70),
       (081220, 101, 82),
       (081221, 101, 76),
       (081241, 101, 90);




UPDATE learn
SET classphones = 3
WHERE number = 101;
#修改课程表课程号101课程学分为3

/*
DELETE
FROM student
WHERE uid = 081241; #删除学生成绩

 */
DELETE
FROM class
WHERE classphone = 081241; #删除学生信息
UPDATE course
SET coursemax= 2
WHERE coursemax = 4;
#更改班级人数

# DROP DATABASE student21333; #删库
CREATE DATABASE student21333; #创建数据库